*****  Implementation of `FuncArgs`

#+begin_src rust
impl<$($args: Send + AbiTy,)*> FuncArgs for ($($args,)*) {
    const _PRIVATE_EXTERN_TY: &'static [ExternTy] = &[ // --> This is used to check at compile time
        $(<$args as AbiTy>::_PRIVATE_EXTERN_TY,)*      // the arguments passed to the exported function
    ];                                                 // of the blob

    // this function will set the registers of the VmCtx to the arguments
    // this is used to call an exported function by the blob to set up all the register
    // and then call the function
    #[allow(unused_mut)]
    #[allow(unused_variables)]
    #[allow(non_snake_case)]
    fn _set(self, mut set_reg: impl FnMut(u32)) {
        let ($($args,)*) = self;
        $($args._set(&mut set_reg);)*
    }
}
#+end_src

#+RESULTS:
: error: Could not compile `cargoOWG3Z1`.



